"""
Задание 7.3b
Сделать копию скрипта задания 7.3a.
Переделать скрипт:
- Запросить у пользователя ввод номера VLAN.
- Выводить информацию только по указанному VLAN.
Пример работы скрипта:
Enter VLAN number: 10
10       0a1b.1c80.7000      Gi0/4
10       01ab.c5d0.70d0      Gi0/8
Ограничение: Все задания надо выполнять используя только пройденные темы.
"""

input_vlan = input("Введите VLAN: ")

with open('web-dev-python/task_7/CAM_table.txt', 'r') as f:
    for line in f:
        words = line.split()
        if words and words[0].isdigit() and words[0] == input_vlan:
            vlan, mac, _, interface = words
            print(f"{vlan:10}{mac:20}{interface}")